from laba2 import find_words 
def test_word_filter():
    result = find_words("Інколи люди шукають істину в найпростіших речах, і саме там знаходять свої найбільші ідеї. Істина часто прихована у дрібницях, які ми ігноруємо в повсякденному житті. Інші, на жаль, ігнорують важливі деталі, що стають на заваді до успіху. Іноді варто звертати більше уваги на інтуїцію, яка може підказати правильний шлях. Інженери, інспектори, інвестори — всі вони мають свої інтереси, але інколи їхні цілі можуть збігатися.")
    assert result == ["Інколи", "істину", "ідеї", "Істина", "ігноруємо", "Інші", "ігнорують", "Іноді", "інтуїцію", "Інженери", "інспектори", "інвестори", "інтереси", "інколи"]
 
def test_word_filter():
    result = find_words("Якби існували идоли інструкції до життя, ідеально б дотримуватися кожного пункту, навіть найменшого, бо це допомогло б уникнути багатьох помилок. Ідеї, інсайти, інструменти — все це може сприяти особистісному зростанню. Існування такої інструкції могло б зробити наше життя простішим. Іноді, не маючи плану, люди губляться у вирі подій і не можуть знайти правильний шлях. Інші ж знаходять натхнення в хаосі й невизначеності, імпровізують і рухаються вперед без чіткого плану.")
    assert result == ["існували", "идоли","інструкції", "ідеально", "Ідеї", "інсайти", "інструменти", "Існування", "інструкції", "Іноді", "Інші", "імпровізують"]
